---
kind: type
id: T:Autodesk.Revit.DB.GBXMLExportOptions
source: html/abb350ef-a773-7b70-6881-166e6f3c0a56.htm
---
# Autodesk.Revit.DB.GBXMLExportOptions

Green-Building XML Export options.

## Syntax (C#)
```csharp
public class GBXMLExportOptions : IDisposable
```